CSV Operations

In [6]:
import pandas as pd
dict1 = {
    "name" : ["Hari","Soham","Suhana","Neha"],
    "marks" :[92,34,24,17],
    "city" :["rampur","kolkata","bareilly","antarctica"]
}
df = pd.DataFrame(dict1)
df

     name  marks        city
0    Hari     92      rampur
1   Soham     34     kolkata
2  Suhana     24    bareilly
3    Neha     17  antarctica

In [8]:
df.to_csv("Friends.csv")

In [12]:
df.to_csv("Friends_indexFalse.csv",index = False) #index will remove

In [16]:
df.head(2) #first two values

    name  marks     city
0   Hari     92   rampur
1  Soham     34  kolkata

In [18]:
df.tail(2) #last two values

     name  marks        city
2  Suhana     24    bareilly
3    Neha     17  antarctica

In [20]:
df.describe() #To do statistical Analysis

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [38]:
new = pd.read_csv("new.csv")
new

   Product ID  Quantity  Colour  Price
0       12322        10   Black   1234
1       12323        12    Blue   1450
2       12333        16     Red   2300
3       12444        24    Pink   2134
4       11555        36    Grey   3214
5       12321        44  Yellow   3244
6       13256        67  Orange   4356
7       14321        49    Pink   2222
8       18765        78   White   3567

In [44]:
new["Colour"]

0     Black
1      Blue
2       Red
3      Pink
4      Grey
5    Yellow
6    Orange
7      Pink
8     White
Name: Colour, dtype: object

In [52]:
new["Colour"][0]

'Black'

In [60]:
new["Quantity"][0]

10

In [62]:
new["Quantity"][0] = 50

C:\Users\HP\AppData\Local\Temp\ipykernel_6820\314594447.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new["Quantity"][0] = 50
C:\Users\HP\AppData\Local\Temp\ipykernel_6820\314594447.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new["Quantity"][0] = 50

In [64]:
new

   Product ID  Quantity  Colour  Price
0       12322        50   Black   1234
1       12323        12    Blue   1450
2       12333        16     Red   2300
3       12444        24    Pink   2134
4       11555        36    Grey   3214
5       12321        44  Yellow   3244
6       13256        67  Orange   4356
7       14321        49    Pink   2222
8       18765        78   White   3567

In [68]:
new.to_csv("new.csv")

In [88]:
new.index = ['first','second','third','fourth','fifth','sixth','seventh','eighth','ninth']

In [ ]:
new

         Product ID  Quantity  Colour  Price
first         12322        50   Black   1234
second        12323        12    Blue   1450
third         12333        16     Red   2300
fourth        12444        24    Pink   2134
fifth         11555        36    Grey   3214
sixth         12321        44  Yellow   3244
seventh       13256        67  Orange   4356
eighth        14321        49    Pink   2222
ninth         18765        78   White   3567